{
  "filmes": [
    {
      "titulo": "MIB: Homens de Preto",
      "urlFoto": "https://i.pinimg.com/originals/83/42/69/8342697fa38287d03c8c919187d74bd9.jpg",
      "dtLancamento": "1997-07-11T03:00:00.000Z",
      "descricao": "Kay e Jay, os \"Homens de Preto\", são o maior segredo já mantido no universo. Eles são agentes de uma agência não-oficial do governo e responsáveis por monitorar todos os encontros com alienígenas na Terra. Ao investigar uma série de atividades extraterrestres, descobrem um terrorista intergaláctico cuja missão é assassinar dois embaixadores de galáxias opostas.",
      "nota": 7.3,
      "urlIMDb": "https://www.imdb.com/title/tt0119654/",
      "genero": "Ação",
      "id": 1
    },
    {
      "titulo": "MIB: Homens de Preto II ",
      "urlFoto": "https://i.pinimg.com/originals/a5/21/54/a5215448328ce09bc288e9ad92414dc4.jpg",
      "dtLancamento": "2012-07-19T03:00:00.000Z",
      "descricao": "Com a Terra sendo ameaçada pela presença de Serleena, uma Kylothian cruel e monstruosa que está disfarçada como uma modelo terráquea, o agente J resolve pedir ajuda ao seu antigo companheiro K, que teve sua memória apagada e agora trabalha nos Correios sob o nome de Kevin Brown. J precisa então restaurar a memória de K, para que possam combater juntos a ameaça.",
      "nota": 6.2,
      "urlIMDb": "https://www.imdb.com/title/tt0120912",
      "genero": "Ação",
      "id": 2
    },
    {
      "titulo": "MIB: Homens de Preto III",
      "urlFoto": "https://s2.glbimg.com/kLdWY_Eell2yMkrsunVdSzgIwv4=/362x536/https://s2.glbimg.com/bxrBlRdfAbJfRhN8rVO7irewWDs=/i.s3.glbimg.com/v1/AUTH_c3c606ff68e7478091d1ca496f9c5625/internal_photos/bs/2019/i/P/wrTLe6SOCpVF6IA0vEZg/2018-172-homens-de-preto-3-poster.jpg",
      "dtLancamento": "2012-05-25T03:00:00.000Z",
      "descricao": "Um extraterrestre planeja voltar no tempo para assassinar o Agente K, mudando o curso da História e colocando a humanidade em risco. Para salvar não apenas a vida do parceiro, mas também o mundo, o Agente J também viaja ao passado para impedir o crime.",
      "nota": 6.8,
      "urlIMDb": "https://www.imdb.com/title/tt1409024/",
      "genero": "Ação",
      "id": 3
    },
    {
      "titulo": "MIB: Homens de Preto - Internacional",
      "urlFoto": "https://i.pinimg.com/736x/7f/e7/51/7fe751c8f111077c4e12c2512f7745aa.jpg",
      "dtLancamento": "2019-06-13T03:00:00.000Z",
      "descricao": "Os agentes H e M usam armas de alta tecnologia para combater alienígenas que podem assumir a forma de qualquer ser humano.",
      "nota": 5.6,
      "urlIMDb": "https://www.imdb.com/title/tt2283336/",
      "genero": "Ação",
      "id": 4
    },
    {
      "titulo": "Coringa",
      "urlFoto": "https://specials-images.forbesimg.com/imageserve/5dae0ad2c538200007810d63/960x0.jpg?fit=scale",
      "dtLancamento": "2019-10-03T03:00:00.000Z",
      "descricao": "Isolado, intimidado e desconsiderado pela sociedade, o fracassado comediante Arthur Fleck inicia seu caminho como uma mente criminosa após assassinar três homens em pleno metrô. Sua ação inicia um movimento popular contra a elite de Gotham City, da qual Thomas Wayne é seu maior representante.",
      "nota": 8.7,
      "urlIMDb": "https://www.imdb.com/title/tt7286456/",
      "genero": "Drama",
      "id": 5
    },
    {
      "titulo": "Vingadores: Ultimato",
      "urlFoto": "https://images.moviesanywhere.com/4677177f6f0595289bc3e767e7b47459/1d6c6c73-ab1e-4453-969c-6a4e965ebb37.jpg",
      "dtLancamento": "2019-04-25T03:00:00.000Z",
      "descricao": "Após Thanos eliminar metade das criaturas vivas, os Vingadores têm de lidar com a perda de amigos e entes queridos. Com Tony Stark vagando perdido no espaço sem água e comida, Steve Rogers e Natasha Romanov lideram a resistência contra o titã louco.",
      "nota": 8.5,
      "urlIMDb": "https://www.imdb.com/title/tt4154796/",
      "genero": "Aventura",
      "id": 6
    },
    {
      "titulo": "Capitã Marvel",
      "urlFoto": "https://mcuexchange.com/wp-content/uploads/2019/01/Dolby-Cinema-Captain-Marvel-Poster.jpeg",
      "dtLancamento": "2019-03-07T03:00:00.000Z",
      "descricao": "Capitã Marvel, parte do exército de elite dos Kree, uma raça alienígena, encontra-se no meio de uma batalha entre seu povo e os Skrulls. Ao tentar impedir uma invasão de larga escala na Terra, em 1995, ela tem memórias recorrentes de uma outra vida, como Carol Danvers, agente da Força Aérea norte-americana. Com a ajuda de Nick Fury, Capitã Marvel precisa descobrir os segredos de seu passado e pôr um fim ao conflito intergalático com os Skrulls.",
      "nota": 6.9,
      "urlIMDb": "https://www.imdb.com/title/tt4154664/",
      "genero": "Ação",
      "id": 7
    },
    {
      "titulo": "Shazam!",
      "urlFoto": "https://mir-s3-cdn-cf.behance.net/project_modules/fs/1e2f8b78552905.5ca7f16f235c3.jpg",
      "dtLancamento": "2019-04-04T03:00:00.000Z",
      "descricao": "Billy Batson tem apenas 14 anos de idade, mas recebeu de um antigo mago o dom de se transformar em um super-herói adulto chamado Shazam. Ao gritar a palavra SHAZAM!, o adolescente se transforma nessa sua poderosa versão adulta para se divertir e testar suas habilidades. Contudo, ele precisa aprender a controlar seus poderes para enfrentar o malvado Dr. Thaddeus Sivana.",
      "nota": 7.1,
      "urlIMDb": "https://www.imdb.com/title/tt0448115/",
      "genero": "Comédia",
      "id": 8
    },
    {
      "titulo": "John Wick 3: Parabellum",
      "urlFoto": "https://i.pinimg.com/originals/da/aa/20/daaa207b189eb8f5dac7a3abca366e4f.jpg",
      "dtLancamento": "2019-05-16T03:00:00.000Z",
      "descricao": "O lendário John Wick luta para sair de Nova York quando um contrato de 14 milhões de dólares faz dele o alvo dos maiores assassinos do mundo.",
      "nota": 7.5,
      "urlIMDb": "https://www.imdb.com/title/tt6146586/",
      "genero": "Ação",
      "id": 9
    },
    {
      "titulo": "Mistério no Mediterrâneo",
      "urlFoto": "https://br.web.img3.acsta.net/pictures/19/06/13/09/35/4216544.jpg",
      "dtLancamento": "2019-06-14T03:00:00.000Z",
      "descricao": "A trama misteriosa de Mistério no Mediterrâneo tem personagens caricatos e é marcada pelo humor característico da dupla, que precisa provar não ser responsável pelo assassinato de um bilionário. Quando se casou, o policial Nick Spitz (Adam Sandler) prometeu à esposa, Audrey (Jennifer Aniston), uma viagem pela Europa.",
      "nota": 6,
      "urlIMDb": "https://www.imdb.com/title/tt1618434/",
      "genero": "Comédia",
      "id": 10
    },
    {
      "titulo": "Star Wars: A Ascensão Skywalker",
      "urlFoto": "https://image.tmdb.org/t/p/original/lFx2i2pg1BoaD7grcpGDyHM1eML.jpg",
      "dtLancamento": "2019-12-19T03:00:00.000Z",
      "descricao": "Com o retorno do Imperador Palpatine, a Resistência toma a frente da batalha. Treinando para ser uma completa Jedi, Rey se encontra em conflito com passado e futuro, e teme pelas respostas que pode conseguir com Kylo Ren.",
      "nota": 6.9,
      "urlIMDb": "https://www.imdb.com/title/tt2527338/?ref_=vi_md_ti",
      "genero": "Aventura",
      "id": 11
    },
    {
      "titulo": "Zack Snider´s - Justice League",
      "urlFoto": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcTagisnj5sR5hw6gvArBxAI8UROo8mpbbLBsICDrJebKFeBComA",
      "dtLancamento": "2021-03-01T03:00:00.000Z",
      "descricao": "Impulsionado pela restauração de sua fé na humanidade e inspirado pelo ato altruísta do Superman, Bruce Wayne convoca sua nova aliada Diana Prince para o combate contra um inimigo ainda maior, recém-despertado. Juntos, Batman e Mulher-Maravilha buscam e recrutam com agilidade um time de meta-humanos, mas mesmo com a formação da liga de heróis sem precedentes, poderá ser tarde demais para salvar o planeta de um catastrófico ataque.",
      "nota": 10,
      "urlIMDb": "https://www.imdb.com/title/tt12361974/",
      "genero": "Aventura",
      "id": 14
    },
    {
      "titulo": "Hereditário",
      "urlFoto": "https://i.pinimg.com/564x/d7/61/98/d761986f2f729868ac8dba91c67101dc.jpg",
      "dtLancamento": "2018-06-21T03:00:00.000Z",
      "descricao": "Após a morte da reclusa avó, a família Graham começa a desvendar algumas coisas. Mesmo após a partida da matriarca, ela permanece como se fosse uma sombra sobre a família, especialmente sobre a solitária neta adolescente, Charlie, por quem ela sempre manteve uma fascinação não usual. Com um crescente terror tomando conta da casa, a família explora lugares mais escuros para escapar do infeliz destino que herdaram.",
      "nota": 7.3,
      "urlIMDb": "https://www.imdb.com/title/tt7784604/",
      "genero": "Terror",
      "id": 15
    },
    {
      "titulo": "Mad Max - A estrada da fúria",
      "urlFoto": "https://i.pinimg.com/736x/b0/aa/57/b0aa571b599320a60edb494a083725dd.jpg",
      "dtLancamento": "2015-05-14T03:00:00.000Z",
      "descricao": "Em um mundo pós-apocalíptico, Max Rockatansky acredita que a melhor forma de sobreviver é não depender de ninguém. Porém, após ser capturado pelo tirano Immortan Joe e seus rebeldes, Max se vê no meio de uma guerra mortal iniciada pela Imperatriz Furiosa, que tenta salvar um grupo de garotas. Também tentando fugir, Max aceita ajudar Furiosa.",
      "nota": 8.1,
      "urlIMDb": "https://www.imdb.com/title/tt1392190/",
      "genero": "Ficção cientifica",
      "id": 16
    },
    {
      "titulo": "10 coisas, que eu odeio em você",
      "urlFoto": "https://image.tmdb.org/t/p/original/lsCDtBiviZnENBDBBsxMXV6g3EP.jpg",
      "dtLancamento": "1999-08-06T03:00:00.000Z",
      "descricao": "Bianca Stratford é bonita e popular, mas não pode namorar antes de sua irmã mais velha. O problema é que nenhum garoto consegue chegar perto da irmã, Kat Stratford. Para resolver a situação, um rapaz interessado em Bianca suborna um amigo com passado misterioso para sair com Kat e, quem sabe, tentar conquistá-la.",
      "nota": 7.1,
      "urlIMDb": "https://www.imdb.com/title/tt0147800/",
      "genero": "Romance",
      "id": 17
    },
    {
      "titulo": "Suspiria",
      "urlFoto": "https://i.etsystatic.com/16253244/r/il/e8d3cd/1886282622/il_570xN.1886282622_2999.jpg",
      "dtLancamento": "2019-04-11T03:00:00.000Z",
      "descricao": "Susie Bannion, uma jovem bailarina americana, vai para a prestigiada Markos Tanz Company, em Berlim. No mesmo dia de sua chegada, a também dançarina Patricia desaparece misteriosamente. Tendo um progresso extraordinário e se destacando logo em seu teste, com a orientação de Madame Blanc, Susie acaba fazendo amizade com outra dançarina, Sara, que compartilha com ela todas as suas suspeitas obscuras e ameaçadoras do conceituado local.",
      "nota": 6.8,
      "urlIMDb": "https://www.imdb.com/title/tt1034415/",
      "genero": "Terror",
      "id": 18
    },
    {
      "titulo": "Destruição Final: o último refúgio",
      "urlFoto": "https://cineclick-static.flixmedia.cloud/1080/69/1080x1620_1604512436.jpg",
      "dtLancamento": "2020-11-19T03:00:00.000Z",
      "descricao": "Uma família luta pela sobrevivência quando um cometa destruidor de planetas chega à Terra. John Garrity (Gerard Butler), a sua ex-mulher Allison (Morena Baccarin), e o seu jovem filho, Nathan, fazem uma perigosa viagem até à sua derradeira esperança de salvação. Por entre terríveis relatos de destruição a nível mundial, a família Garrity experiencia o melhor e o pior da Humanidade, à medida que a contagem decrescente para o apocalipse global se aproxima do zero.",
      "nota": 6.4,
      "urlIMDb": "https://www.imdb.com/title/tt7737786/",
      "genero": "Ação",
      "id": 20
    }
  ]
}